Repository: plugcreator2002/psr_base
Catalog: lib/plugin_emulators/forms_builder/languages/l10n/intl_*.arb
Languages: ar, ja

# requiredErrorText
source: This field cannot be empty.
ar: هذا الفراغ يجب املاؤه.
ja: 必須項目です。

# equalErrorText
source: This field value must be equal to {value}.
ar: يجب أن تكون قيمة هذا الفراغ مساوية لـ {value}.
ja: {value}に一致していません。

# notEqualErrorText
source: This field value must not be equal to {value}.
ar: يجب أن لا تكون قيمة هذا الفراغ مساوية لـ {value}.
ja: {value}と違うものにしてください。

# minErrorText
source: Value must be greater than or equal to {min}.
ar: يجب أن تكون قيمة هذا الفراغ مساوية او اكثر من {min}.
ja: {min}以上にしてください。

# minLengthErrorText
source: Value must have a length greater than or equal to {minLength}
ar: يجب أن يكون حجم هذا الفراغ مساوي او اكثر من {minLength}.
ja: {minLength}文字以上で入力してください。

# maxErrorText
source: Value must be less than or equal to {max}
ar: يجب أن تكون قيمة هذا الفراغ مساوية او اقل من {max}.
ja: {max}以下にしてください。

# maxLengthErrorText
source: Value must have a length less than or equal to {maxLength}
ar: يجب أن يكون حجم هذا الفراغ مساوي او اقل من {maxLength}.
ja: {maxLength}文字以下で入力してください。

# emailErrorText
source: This field requires a valid email address.
ar: هذا الفراغ يتطلب عنوان بريد إلكتروني صالح.
ja: 有効なメールアドレスを入力してください。

# urlErrorText
source: This field requires a valid URL address.
ar: هذا الفراغ يتطلب عنوان موقع URL صالح.
ja: 有効なURLを入力してください。

# matchErrorText
source: Value does not match pattern.
ar: قيمة الفراغ لا تطابق النمط.
ja: 有効な正規表現を指定してください。

# numericErrorText
source: Value must be numeric.
ar: قيمة الفراغ ليست رقمية.
ja: 半角数字で入力してください。

# integerErrorText
source: This field requires a valid integer.
ar: قيمة الفراغ ليست رقمية صحيحة.
ja: 整数で入力してください。

# creditCardErrorText
source: This field requires a valid credit card number.
ar: قيمة الفراغ ليست رقم بطاقة ائتمانيه صحيحة.
ja: 有効なクレジットカード番号を入力してください。

# ipErrorText
source: This field requires a valid IP.
ar: هذا الفراغ يتطلب رقم IP صالح.
ja: 有効なIPアドレスを入力してください。

# dateStringErrorText
source: This field requires a valid date string.
ar: هذا الفراغ يتطلب تاريخ صالح.
ja: 正しい日付を入力してください。
